{"class_name": "Functional", "config": {"name": "model_3", "layers": [{"class_name": "InputLayer", "config": {"batch_input_shape": [null, 384, 1248, 3], "dtype": "float32", "sparse": false, "ragged": false, "name": "rgb"}, "name": "rgb", "inbound_nodes": []}, {"class_name": "ZeroPadding2D", "config": {"name": "Block1_rgb_zp", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "Block1_rgb_zp", "inbound_nodes": [[["rgb", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Block1_rgb_conv", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [4, 4], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Block1_rgb_conv", "inbound_nodes": [[["Block1_rgb_zp", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "Block2_rgb_zp", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "Block2_rgb_zp", "inbound_nodes": [[["Block1_rgb_conv", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Block2_rgb_conv", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Block2_rgb_conv", "inbound_nodes": [[["Block2_rgb_zp", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "Block3_rgb_zp", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "Block3_rgb_zp", "inbound_nodes": [[["Block2_rgb_conv", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Block3_rgb_conv", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [4, 4], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Block3_rgb_conv", "inbound_nodes": [[["Block3_rgb_zp", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "Block4_rgb_zp", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "Block4_rgb_zp", "inbound_nodes": [[["Block3_rgb_conv", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Block4_rgb_conv", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Block4_rgb_conv", "inbound_nodes": [[["Block4_rgb_zp", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "Block5_rgb_zp", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "Block5_rgb_zp", "inbound_nodes": [[["Block4_rgb_conv", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Block5_rgb_conv", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [4, 4], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Block5_rgb_conv", "inbound_nodes": [[["Block5_rgb_zp", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "Block51_rgb_zp", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "Block51_rgb_zp", "inbound_nodes": [[["Block5_rgb_conv", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Block51_rgb_conv", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Block51_rgb_conv", "inbound_nodes": [[["Block51_rgb_zp", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "Block52_rgb_zp", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "Block52_rgb_zp", "inbound_nodes": [[["Block51_rgb_conv", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Block52_rgb_conv", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [4, 4], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Block52_rgb_conv", "inbound_nodes": [[["Block52_rgb_zp", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Block6_rgb_conv", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Block6_rgb_conv", "inbound_nodes": [[["Block52_rgb_conv", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "Block6_rgb_dp", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "name": "Block6_rgb_dp", "inbound_nodes": [[["Block6_rgb_conv", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Block7_rgb_conv", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Block7_rgb_conv", "inbound_nodes": [[["Block6_rgb_dp", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "Block7_rgb_dp", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "name": "Block7_rgb_dp", "inbound_nodes": [[["Block7_rgb_conv", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Block8_rgb_conv", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 2], "groups": 1, "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Block8_rgb_conv", "inbound_nodes": [[["Block7_rgb_dp", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "Block8_rgb_dp", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "name": "Block8_rgb_dp", "inbound_nodes": [[["Block8_rgb_conv", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Block9_rgb_conv", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [2, 4], "groups": 1, "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Block9_rgb_conv", "inbound_nodes": [[["Block8_rgb_dp", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "Block9_rgb_dp", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "name": "Block9_rgb_dp", "inbound_nodes": [[["Block9_rgb_conv", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Block10_rgb_conv", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [4, 8], "groups": 1, "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Block10_rgb_conv", "inbound_nodes": [[["Block9_rgb_dp", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "Block10_rgb_dp", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "name": "Block10_rgb_dp", "inbound_nodes": [[["Block10_rgb_conv", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Block11_rgb_conv", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [8, 16], "groups": 1, "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Block11_rgb_conv", "inbound_nodes": [[["Block10_rgb_dp", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "Block11_rgb_dp", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "name": "Block11_rgb_dp", "inbound_nodes": [[["Block11_rgb_conv", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Block12_rgb_conv", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [16, 32], "groups": 1, "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Block12_rgb_conv", "inbound_nodes": [[["Block11_rgb_dp", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "Block12_rgb_dp", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "name": "Block12_rgb_dp", "inbound_nodes": [[["Block12_rgb_conv", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Block13_rgb_conv", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Block13_rgb_conv", "inbound_nodes": [[["Block12_rgb_dp", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "Block13_rgb_dp", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "name": "Block13_rgb_dp", "inbound_nodes": [[["Block13_rgb_conv", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Block14_rgb_conv", "trainable": true, "dtype": "float32", "filters": 256, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Block14_rgb_conv", "inbound_nodes": [[["Block13_rgb_dp", 0, 0, {}]]]}, {"class_name": "Dropout", "config": {"name": "Block14_rgb_dp", "trainable": true, "dtype": "float32", "rate": 0.25, "noise_shape": null, "seed": null}, "name": "Block14_rgb_dp", "inbound_nodes": [[["Block14_rgb_conv", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "Block15_rgb_convtp", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "Block15_rgb_convtp", "inbound_nodes": [[["Block14_rgb_dp", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "Block16_rgb_zp", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "Block16_rgb_zp", "inbound_nodes": [[["Block15_rgb_convtp", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Block16_rgb_conv", "trainable": true, "dtype": "float32", "filters": 128, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Block16_rgb_conv", "inbound_nodes": [[["Block16_rgb_zp", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "Block162_rgb_convtp", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "Block162_rgb_convtp", "inbound_nodes": [[["Block16_rgb_conv", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "Block163_rgb_zp", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "Block163_rgb_zp", "inbound_nodes": [[["Block162_rgb_convtp", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Block163_rgb_conv", "trainable": true, "dtype": "float32", "filters": 64, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Block163_rgb_conv", "inbound_nodes": [[["Block163_rgb_zp", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "Block17_rgb_convtp", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "Block17_rgb_convtp", "inbound_nodes": [[["Block163_rgb_conv", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "Block18_rgb_zp", "trainable": true, "dtype": "float32", "padding": [[1, 1], [1, 1]], "data_format": "channels_last"}, "name": "Block18_rgb_zp", "inbound_nodes": [[["Block17_rgb_convtp", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "Block18_rgb_conv", "trainable": true, "dtype": "float32", "filters": 32, "kernel_size": [3, 3], "strides": [1, 1], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "Block18_rgb_conv", "inbound_nodes": [[["Block18_rgb_zp", 0, 0, {}]]]}, {"class_name": "Conv2DTranspose", "config": {"name": "Block19_rgb_convtp", "trainable": true, "dtype": "float32", "filters": 8, "kernel_size": [4, 4], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "elu", "use_bias": true, "kernel_initializer": {"class_name": "GlorotUniform", "config": {"seed": null}}, "bias_initializer": {"class_name": "Zeros", "config": {}}, "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null, "output_padding": null}, "name": "Block19_rgb_convtp", "inbound_nodes": [[["Block18_rgb_conv", 0, 0, {}]]]}, {"class_name": "DS1", "config": {"name": "n_distance_prototype", "trainable": true, "dtype": "float32", "units": 6}, "name": "n_distance_prototype", "inbound_nodes": [[["Block19_rgb_convtp", 0, 0, {}]]]}, {"class_name": "DS1_activate", "config": {"name": "n_prototype_activation", "trainable": true, "dtype": "float32", "rate": 0.01}, "name": "n_prototype_activation", "inbound_nodes": [[["n_distance_prototype", 0, 0, {}]]]}, {"class_name": "DS2", "config": {"name": "n_prototype_singleton_mass", "trainable": true, "dtype": "float32", "num_class": 2}, "name": "n_prototype_singleton_mass", "inbound_nodes": [[["n_prototype_activation", 0, 0, {}]]]}, {"class_name": "DS2_omega", "config": {"name": "n_prototype_singleton_omega_mass", "trainable": true, "dtype": "float32"}, "name": "n_prototype_singleton_omega_mass", "inbound_nodes": [[["n_prototype_singleton_mass", 0, 0, {}]]]}, {"class_name": "DS3_Dempster", "config": {"name": "n_unorm_combined_mass", "trainable": true, "dtype": "float32"}, "name": "n_unorm_combined_mass", "inbound_nodes": [[["n_prototype_singleton_omega_mass", 0, 0, {}]]]}, {"class_name": "DS3_normalize", "config": {"name": "n_norm_combined_mass", "trainable": true, "dtype": "float32"}, "name": "n_norm_combined_mass", "inbound_nodes": [[["n_unorm_combined_mass", 0, 0, {}]]]}, {"class_name": "SelectSingleton", "config": {"name": "n_singleton_mass", "trainable": true, "dtype": "float32"}, "name": "n_singleton_mass", "inbound_nodes": [[["n_norm_combined_mass", 0, 0, {}]]]}], "input_layers": [["rgb", 0, 0]], "output_layers": [["n_singleton_mass", 0, 0]]}, "keras_version": "2.8.0", "backend": "tensorflow"}